In [34]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
from sqlalchemy import create_engine
from user_info import username, password
#Formatting output figures
from matplotlib.pylab import rcParams
rcParams['figure.figsize'] = 12,8
rcParams['axes.spines.top'] = False
rcParams['axes.spines.right'] = False

In [35]:
engine = create_engine(f'postgresql://{username}:{password}@localhost:5432/employee_db')
conn = engine.connect()

In [25]:
employee_df = pd.read_sql("select * from employees", conn, parse_dates=['birth_date', 'hire_date'])
employee_df

        emp_no emp_title_id birth_date   first_name  last_name sex  hire_date
0       473302        s0001 1953-07-25     Hideyuki   Zallocco   M 1990-04-28
1       475053        e0002 1954-11-18        Byong  Delgrande   F 1991-09-07
2        57444        e0002 1958-01-30        Berry       Babb   F 1992-03-21
3       421786        s0001 1957-09-28        Xiong   Verhoeff   M 1987-11-26
4       282238        e0003 1952-10-28   Abdelkader    Baumann   F 1991-01-18
...        ...          ...        ...          ...        ...  ..        ...
300019  464231        s0001 1958-08-14  Constantino    Eastman   M 1988-10-28
300020  255832        e0002 1955-05-08       Yuping     Dayang   F 1995-02-26
300021   76671        s0001 1959-06-09       Ortrud   Plessier   M 1988-02-24
300022  264920        s0001 1959-09-22        Percy   Samarati   F 1994-09-08
300023  464503        s0002 1964-05-31       Arvind  Slobodova   M 1987-11-23

[300024 rows x 7 columns]

In [26]:
#Checking for NA values
employee_df[employee_df.isna().any(axis=1)]

Empty DataFrame
Columns: [emp_no, emp_title_id, birth_date, first_name, last_name, sex, hire_date]
Index: []

In [27]:
#Checking for null values
employee_df[employee_df.isnull().any(axis=1)]

Empty DataFrame
Columns: [emp_no, emp_title_id, birth_date, first_name, last_name, sex, hire_date]
Index: []

In [28]:
#Importing salaries table to later visualize the most common salary ranges
salaries_df = pd.read_sql("select * from salaries", conn)
salaries_df

        emp_no  salary
0        10001   60117
1        10002   65828
2        10003   40006
3        10004   40054
4        10005   78228
...        ...     ...
300019  499995   40000
300020  499996   58058
300021  499997   49597
300022  499998   40000
300023  499999   63707

[300024 rows x 2 columns]

In [29]:
#Checking for NA values
salaries_df[salaries_df.isna().any(axis=1)]

Empty DataFrame
Columns: [emp_no, salary]
Index: []

In [30]:
#Checking for null values
salaries_df[salaries_df.isnull().any(axis=1)]

Empty DataFrame
Columns: [emp_no, salary]
Index: []

In [32]:
#Find min to create bin ranges
salaries_df["salary"].min()

40000

In [33]:
#Find max to create bin ranges
salaries_df["salary"].max()

129492

In [ ]:
#Making histogram with salaries
salary_bins = [40000, 50000, 60000, 70000, 80000, 90000, 100000, 110000, 120000, 130000]
salary_labels = ["40 to 50", "50 to 60", "60 to 70", "70 to 80", "80 to 90", "90 to 100", "100 to 110", "110 to 120", "120-130"]
salaries_df["salary"].plot.bar(salary_bins, title="Salary Ranges for Employees", xlabel="Salary Ranges $(K)", ylabel="Employee Count")
plt.xticks(ha="right")
#save as png
plt.savefig(Resources/emp_salary_ranges.png",bbox_inches='tight')
plt.show()